# Задание №3

n = str(input('Введите любое число: '))

# n = int(input('Введите любое число: '))
# sum = n + (n*10 + n) + (n*100 + n*10 + n)
# print(sum)

n1 = int(n)
n2 = n*2
n2 = int(n2)
n3 = n*3
n3 = int(n3)

print(n3+n2+n1)

